---
kind: other
id: Methods.T:Autodesk.Revit.DB.IFC.IFCAggregateIterator
source: html/1a8b6a27-5716-e8df-61e2-3362b7000993.htm
---
# IFCAggregateIterator Methods

Increments the iterator to the next object in the IFCAggregate.